In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats

import datetime

import matplotlib.pyplot as plt
%matplotlib inline

plt.style.use('ggplot')

In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
df_nasdaq = pd.read_csv('nasdaq.csv')

In [4]:
df_nasdaq.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5131 entries, 0 to 5130
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       5131 non-null   object
 1   Open       5131 non-null   float64
 2   High       5131 non-null   float64
 3   Low        5131 non-null   float64
 4   Close      5131 non-null   float64
 5   Adj Close  5131 non-null   float64
 6   Volume     5131 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 280.7+ KB

In [5]:
df_nasdaq.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,4186.189941,4192.189941,3989.709961,4131.149902,4131.149902,1510070000
1,2000-01-04,4020.000000,4073.250000,3898.229980,3901.689941,3901.689941,1511840000
2,2000-01-05,3854.350098,3924.209961,3734.870117,3877.540039,3877.540039,1735670000
3,2000-01-06,3834.439941,3868.760010,3715.620117,3727.129883,3727.129883,1598320000
4,2000-01-07,3711.090088,3882.669922,3711.090088,3882.620117,3882.620117,1634930000

In [6]:
df_nasdaq = df_nasdaq[['Date','Close']]

In [7]:
df_nasdaq.rename(columns = {'Date':'date', 'Close':'nasdaq_close'}, inplace = True)

In [8]:
df_nasdaq['date'] = pd.to_datetime(df_nasdaq['date'], yearfirst = True)

In [9]:
df_nasdaq['nasdaq_close_lag1'] = df_nasdaq['nasdaq_close'].shift(1)

In [10]:
df_nasdaq['nasdaq_change%'] = 100*((df_nasdaq['nasdaq_close_lag1'] - df_nasdaq['nasdaq_close']) / df_nasdaq['nasdaq_close'])

In [11]:
df_nasdaq.head()

        date  nasdaq_close  nasdaq_close_lag1  nasdaq_change%
0 2000-01-03   4131.149902                NaN             NaN
1 2000-01-04   3901.689941        4131.149902        5.881040
2 2000-01-05   3877.540039        3901.689941        0.622815
3 2000-01-06   3727.129883        3877.540039        4.035549
4 2000-01-07   3882.620117        3727.129883       -4.004776

In [12]:
%store df_nasdaq

Stored 'df_nasdaq' (DataFrame)